{
  "replies": [
    {
      "content": "In order to get it to work, I had to open the port on my Vultr firewall AND add this line. \"sudo ufw allow 37466/udp\" Working great now! Thanks for the write-up!",
      "url": "https://commentpara.de/comment/1000.htm",
      "type": "reply",
      "date": "2022-04-08T14:01:12Z",
      "author": "Anonymous",
      "authorPhoto": "https://cdn.hacdias.com/wm/ef200c8b639d79d1cfbc0abf0e25f42dcbc585b4398003dd90f5a56c9d56e3bf.svg"
    },
    {
      "content": "I have setup things as described - however after after installing some OS updates on the VPS despite having set the client to work with full tunnel, all traffic that does not go to the local subnet now gets routed to the internet using the VPS ip. Any idea what might cause this?",
      "url": "https://commentpara.de/comment/955.htm",
      "type": "reply",
      "date": "2022-01-29T22:20:25Z",
      "author": "Anonymous",
      "authorPhoto": "https://cdn.hacdias.com/wm/ef200c8b639d79d1cfbc0abf0e25f42dcbc585b4398003dd90f5a56c9d56e3bf.svg"
    },
    {
      "content": "Are you sure this line is correct: sudo systemctl enable wg-quick@wg0 Perhaps your blogging platform auto-added the link?",
      "url": "https://commentpara.de/comment/846.htm",
      "type": "reply",
      "date": "2021-05-09T13:50:03Z",
      "author": "Anonymous",
      "authorPhoto": "https://cdn.hacdias.com/wm/5aa6fd75912434a7063020ae39c373ee5a21b44b726383b4295a18bd665a25d9.svg"
    },
    {
      "content": "Dont forget to open the used Port in the Settings of the VPS!",
      "url": "https://commentpara.de/comment/818.htm",
      "type": "reply",
      "date": "2021-03-11T20:49:12Z",
      "author": "Anonymous",
      "authorPhoto": "https://cdn.hacdias.com/wm/5aa6fd75912434a7063020ae39c373ee5a21b44b726383b4295a18bd665a25d9.svg"
    }
  ],
  "interactions": [
    {
      "name": "Running Wireguard VPN Client on Router",
      "content": "Hello guys, I had few questions. Please go easy on me if I am doing something really dumb. I have 2 routers. a) Home router b) Travel Router (both capable of adding a VPN Client) Both routers are behind CGNAT (they don\u0026#39;t get a public ip address which can be reached from outside) But I wanted to connect to my home network via my travel network. After a lot of digging I found this guide. [https://hacdias.com/2020/11/30/access-network-behind-cgnat](https://hacdias.com/2020/11/30/access-network-behind-cgnat) Basically host a VPN Server in the cloud and then make both the networks connect to it. That way you can make them function as a part of the same network (this part might be wrong so please correct me if it is). Before that I am planning to have following IP subnet for these networks: Home Network : 192.168.1.X VPN Server In The Cloud : 192.168.3.X Travel Network : 192.168.2.X [Just for reference \\(I will go into the exact config. later](https://preview.redd.it/ss50i3tef1581.png?width=845\u0026amp;format=png\u0026amp;auto=webp\u0026amp;v=enabled\u0026amp;s=f3f11c5bd9779ceff8e181702bb1eaf656375734) So my question here is, if I create 2 peers (one for my home router and one for my travel router), will they get ip addresses in the same range which are set on the VPN config file? ​ Like if my PC and phone is connected to my router (so will the router VPN Client will give it an ip like [192.168.1.3](https://192.168.1.3) and [192.168.1.4](https://192.168.1.4) and so on?) Similarly if my laptop and iphone are connected to travel router will they get ip address like [192.168.2.5](https://192.168.2.5) and [192.168.2.](https://192.168.2.5)6 and so on? ​ These numbers/ip assignment order might be wrong but I am just asking if can you connect multiple devices via 1 peer on the vpn server? (like the peer id will be used as client on the router and not an individual device) ​ Some concepts might be wrong here, but I am trying my best to learn. I am new to linux and all this so please sorry if I am doing something really wrong. Bookmark: reddit.com/r/selfhosted/c... https://192.168.1.3 https://192.168.1.4 https://192.168.2.5 https://hacdias.com/2020/11/30/access-network-behind-cgnat https://preview.redd.it/ss50i3tef1581.png?width=845\u0026amp;format=png\u0026amp;auto=webp\u0026amp;v=enabled\u0026amp;s=f3f11c5bd9779ceff8e181702bb1eaf656375734",
      "url": "https://brid.gy/post/reddit/hacdias/regybn",
      "type": "bookmark",
      "date": "2021-12-12T04:25:46Z",
      "author": "Prasanna_Naik09",
      "authorPhoto": "https://cdn.hacdias.com/wm/537e775fb965c5e4ba31ba0393a3bbfb6f8dc12f0b0dbe0cd6673f86060a832e.png",
      "authorUrl": "https://reddit.com/user/Prasanna_Naik09/"
    },
    {
      "content": "I'm looking to create a small box, probably raspberry pi, that I will give to my clients that will allow me to connect to their local network and have access to heir devices on the network. All that they need to do is plugin power and ethernet. It should not require to have any ports open or require any changes to their local network. It should work behind CGNAT. Now, has anybody done this kind of setup? I'm thinking I need to create a tunel between my machine and the raspberry pi using a VPS as a bridge. Edit: I would like to add that I need direct access to their network, not to SSH into to RPI and then from RPI to other devices. My PC - (VPN tunel) - client PC/PLC. I cannot connect to RPI first because I have tools that are windows only. ​ Edit 2: After reading your commends and after a bit of googling I was successful at acheving what I needed by following [this tutorial](https://hacdias.com/articles/2020/11/access-network-behind-cgnat/) This is my final config: [https://pastebin.com/raw/TfYeWFpP](https://pastebin.com/raw/TfYeWFpP) NOTE: this allows one way communication from my pc to client network devices. Client devices cannot initiate communication without changing their routing table. Bookmark: reddit.com/r/selfhosted/c... https://hacdias.com/articles/2020/11/access-network-behind-cgnat/ https://pastebin.com/raw/TfYeWFpP",
      "url": "https://brid.gy/post/reddit/hacdias/piwnap",
      "type": "bookmark",
      "date": "2021-09-06T10:13:15Z",
      "author": "codebreaker101",
      "authorPhoto": "https://cdn.hacdias.com/wm/c391227f3e5f84d5b0bc07ba3a620f0ae322950f6d40fe35db5392453e8404d5.png",
      "authorUrl": "https://reddit.com/user/codebreaker101/"
    }
  ]
}