{
  "replies": [
    {
      "name": "un internet polyglotte",
      "content": "Cet article est ma contribution au carnaval IndieWeb d’octobre 2024, sur le sujet Le multilinguisme sur un web global. L’article en anglais est ici. ToggleUn peu de contexte : le multilinguisme comme effet secondaireAttends mais pourquoi j’écris en anglais, là ?Bon, on fait quoi ?Au service de nos propres languesUn peu de curiositéPost-scriptum : TwitterUn peu de contexte : le multilinguisme comme effet secondaire Je suis très fier, et un peu gêné, de parler plusieurs langues, exactement de la même façon que je suis très fier et un peu gêné d’être fier d’être Français. J’ai grandi au Québec, avec des parents français pour qui il était très important que 1. j’apprenne l’anglais le plus possible, et 2. je comprenne exactement à quel point le québécois est moins bien que le français de France. Je suis vraiment content que les lois de protection de la langue française au Québec les aient forcés à m’envoyer en école francophone. Je me contenterai d’un bref : Être snob, ça pue. Résultat : mon québécois a très mal tenu le coup (ça fait 20 ans, après tout), et j’essaie d’écouter des podcasts québecois et d’interagir avec des Québécois le plus possible pour ne pas tout perdre. Quand j’étais gamin, je me croyais bilingue parce que je parlais français de France et français du Québec. Ensuite, on est rentrés en France. D’un coup, je me retrouvais bilingue parce que je parlais anglais et français. Mon anglais n’avait rien de bilingue, mais par rapport à mes camarades de classe, il n’y avait évidemment pas comparaison. J’ai travaillé dur pendant beaucoup de vacances, et enfin j’ai intégré un lycée international, où presque tous mes amis étaient anglophones natifs. À la fin du lycée, j’étais, pour le coup, vraiment bilingue (pas natif, mais bilingue). Au lycée, je faisais aussi du patinage de vitesse. On faisait pas mal de compétitions internationales, donc j’ai pu améliorer mon italien, mon allemand, et surtout mon anglais en l’exposant à plein d’accents différents, qu’ils soient britanniques ou utilisés comme lingua franca. D’autres langues se sont naturellement ajoutées : je parle français et italien, donc je comprends à peu près l’espagnol écrit, je parle anglais et un peu allemand, donc je m’en sors avec un texte en néerlandais. J’ai passé quatre mois à Shanghai pour un échange étudiant et à la fin, je pouvais avoir une conversation simple en mandarin − j’ai tout oublié depuis. J’ai fait un an de russe, et je dois admettre que c’est mon plus profond échec linguistique : je n’ai strictement rien appris. Je suis très fier de parler plusieurs langues, et j’ai aussi parfaitement conscience que très peu de tout ça vient de mon travail. Je parle anglais parce que mes parents ont tout fait pour que je parle anglais, puis parce que mon métier se faisait en anglais, et puis ma vie sociale aussi, et puis certains pans de ma vie amoureuse au passage. Je parle italien parce que j’étais tellement pathétique à l’adolescence que c’était plus facile de me faire des potes dans un autre pays. Je parle allemand parce que j’ai passé neuf mois à Munich. Le fait que je sois polyglotte est surtout un témoin du fait que ma famille a eu de la thune − tant mieux pour moi. Bref : le contexte est donné, vous savez quelles langues je parle, on peut attaquer le sujet. Parlons d’abord d’une conséquence négative de ce multilinguisme : j’ai l’habitude de comprendre des textes dans plusieurs langues. Du coup, je n’utilise que peu la traduction automatique… donc je me ferme de tous les contenus dans des langues que je ne connais pas, par manque de réflexe. C’est dommage. Il faut que j’y travaille ! Il y a deux autres informations que vous devriez savoir avant qu’on attaque la suite : Je suis patriote. C’est-à-dire que j’ai parfaitement conscience que je ne suis français que par la chance d’être né au bon endroit avec les bons parents. Mais je ne voudrais vivre nulle part ailleurs (j’ai essayé) et je suis très fier de faire partie de ce peuple. Soyons clairs : c’est surtout parce que des gens ont fait des choses fantastiques il y a 300 ans, 100 ans ou 60 ans. Ces gens n’étaient pas forcément Français, d’ailleurs. Mais ils ont mis en place le système qu’on a la chance d’avoir aujourd’hui. C’est pour ça que je crise, d’ailleurs, quand on fait n’importe quoi. Je suis fier de mon pays et j’aimerais bien avoir de bonnes raisons de l’être. Je me considère patriote et pas nationaliste. J’ai travaillé en localisation pendant longtemps. Tout le principe de mon boulot, c’était de sortir du paradigme « l’anglais est la langue par défaut d’Internet ». J’ai même travaillé sur l’initiative No Language Left Behind (pas de langue laissée pour compte) de Meta AI sur les langues en voie de disparition. Attends mais pourquoi j’écris en anglais, là ? La version originale de cet article, comme beaucoup d’autres sur mon blog, est en anglais. (Je suis en train de le traduire vers le français, plutôt que l’inverse.) Pourquoi ? J’ai plus de lecteurs qui parlent anglais que français, que ce soit nativement ou non. À ce stade de ma vie, je pense en anglais la moitié du temps : mon travail est en anglais, mes lectures sont en anglais (sauf pour mon rapport aux actualités), les vidéos que je regarde sont en anglais. Le thème de l’article a été écrit en anglais, et j’ai pris conscience à mi-chemin dans l’introduction que j’aurais pu ne pas répondre en anglais. C’est malin… Internet a été conçu pour en pas être un lieu. Toute la force d’Internet, c’était d’enlever les frontières, les limites géographiques et les contraintes physiques. Mon PDG va être ravi. Il adore citer la déclaration d’indépendance du cyberespace et je suis en train de le copier (traduction personnelle) : Le cyberespace se compose de transactions, de relations et de la pensée elle-même, qui sert d’onde stationnaire au réseau de nos communications. Notre monde est partout et nulle part à la fois. Il n’est pas là où existent les corps. Et tant qu’à imiter mon PDG, je vais continuer en répétant son argument : à cette déclaration, nous répondons que les données doivent retrouver leur matérialité. Il faut créer des lieux sur Internet et sortir de l’image d’un concept abstrait, ouvert et sans limite. Les cozy corners de nos conversations privées sont une solution en soi : dans ces conversations, je parle français en sachant que les non-francophones ne sont tout simplement pas là. Mais ils ne règlent pas véritablement le problème. Je pense que ce qui se rapproche le plus de lieux sur Internet, ce sont les instances du fédivers. Sur Lemmy, j’ai un compte sur l’instance francophone et française jlai.lu et je peux interagir avec des instances et communautés non francophones et non françaises, tout en signalant que j’en viens. On sait d’où je parle, je me suis situé. Si je choisissais de ne pas être de France et francophone, je pourrais tout à fait être du monde gay, ou de Linux, ou du communisme. En l’occurrence, dans mon cas, l’instance géographique et linguistique correspondait le mieux à mon sens de l’identité, donc j’ai choisi celle-ci. D’ailleurs, plus j’y pense, plus je me dis que mon problème n’est pas l’anglais comme langue hégémonique mais la culture américaine comme culture hégémonique, l’anglais n’en étant qu’un effet secondaire. Les actualités sur la France (ou non) mais en anglais, c’est super, j’adore ça ! Les actualités en français sur une élection à la con dans un pays à la con à un continent de là, ça me saoule au moins autant que celles en anglais sur le même sujet. Je ne peux juste pas choisir de ne pas y être exposé. En d’autres mots, l’anglophonie ça va, la francophonie ça va, la France en anglais c’est rigolo et les États-Unis en français ça me file des boutons. J’espère que ce monologue rageur aura fait passer le message, aussi alambiqué soit mon propos : en localisation, on utilise des locales en quatre lettres et pas deux. fr_FR, ce n’est pas fr_CA, qui n’est pas fr_CI, fr_BE, fr_CH ou fr_DZ. Bref, la langue est importante mais la locale, le contexte culturel et géographique, l’est plus encore. Internet, aujourd’hui, tend à écraser tout ça, donc on confond « l’anglais comme lingua franca » et « l’aplatissement et l’affadissement général et déprimant de l’Internet moderne ». Bon, on fait quoi ? Ben je sais pas. Essayons quand même quelques pistes. Au service de nos propres langues On peut se concentrer sur notre propre langue en essayant de trouver un équilibre linguistique sur nos blogs. On peut décider que notre blog ne sera que dans notre langue locale. Pendant dix ans, c’est le choix que j’ai fait avec Réussir Mes Études, n’écrivant qu’en français pour un public qui ne pouvait ou ne voulait pas se contenter de ressources en anglais. J’en suis très fier, surtout parce qu’au début il n’y avait presque pas de ressources en français sur le sujet. (Effet positif au passage : j’ai pu gagner ma vie avec ce blog parce qu’il se retrouvait sans concurrence, alors qu’il n’aurait pas rapporté un centime en anglais avec le même contenu.) On peut aussi décider que qui a réussi à trouver son blog va réussir à utiliser DeepL ou une autre solution de traduction automatique. Peut-être qu’on n’a plus du tout besoin de lingua franca, finalement. Je suis toujours ravi quand Sara m’envoie un mail ou un commentaire en français, et je prends aussi doucement le réflexe de mettre ses posts en slovène dans un outil de traduction. De cette façon, on peut combattre le préjugé que j’ai exprimé plus haut, selon lequel « mes lecteurs parlent anglais ». À moins d’avoir besoin de beaucoup nuancer mon propos, ils comprendront très bien l’essentiel du message avec une traduction automatique. On peut prendre le temps de traduire manuellement nos articles de blog (comme ici, ou pour mon article sur la consommation d’actualités), et même de traduire des choses intéressantes écrites par d’autres gens dans sa propre langue. On peut se battre pour que nos entreprises traduisent leurs contenus dans au moins une langue en dehors de l’anglais. On peut participer à un Internet de sa propre langue : répondre dans sa langue à quelqu’un qui la parle, avoir un blogroll pour sa langue (d’ailleurs, si vous connaissez un blogroll en italien, prévenez-moi, je désespère). On pourrait même demander à WordPress d’avoir une solution décente pour les blogs multilingues, mais ça, j’y suis pas encore ! Un peu de curiosité Pour ceux d’entre nous dont la langue s’est propagée avec la colonisation (ou continue à bénéficier du néo-colonialisme), il est temps de se plonger dans les évolutions de notre langue en dehors de notre propre sphère géographique et culturelle. En français, voilà quelques usages que j’aime bien : comment la musique transforme le français en Côte d’Ivoire, les chansons de P’tit Belliveau en acadien, le comeback du français de Louisiane… On peut aussi contribuer au Wiktionnaire et y ajouter tous nos régionalismes. Si on aime apprendre de nouvelles choses, pourquoi pas l’espéranto, ou des langues marrantes comme le toki pona. On peut « tout simplement » essayer une nouvelle langue. On peut aussi apprécier une bonne dose de techno-optimisme (si, si !) et découvrir comment l’intelligence artificielle peut être utilisée pour protéger des langues en danger. Et quand on tombe sur un blog cool avec des posts en langue étrangère, on peut prendre le réflexe de la traduction automatique et s’ouvrir tout un nouveau pan d’Internet. Post-scriptum : Twitter Plusieurs fois au cours des années 2010, j’ai essayé de créer deux comptes Twitter pour séparer l’anglais et le français et faciliter la vie de mes followers monolingues. J’ai toujours fini par abandonner celui en anglais. Sur Twitter, je me retrouvais toujours à poster en français et à utiliser l’anglais presque exclusivement pour répondre à d’autres gens, donc c’était une perte de temps et d’énergie. Twitter étant mort noyé (t’étais comme un frère salope), il n’y a pas grand-chose à faire de cette information, mais c’était dans le thème alors je pose ça là. Faites-en ce que vous voudrez. https://alexsirac.com/wp-content/uploads/2023/01/cropped-cropped-cropped-portraitplante-100x100.webp",
      "author": "Alex",
      "authorUrl": "https://alexsirac.com",
      "date": "2024-10-13T13:40:33+02:00",
      "url": "https://alexsirac.com/un-internet-polyglotte/",
      "type": "unknown"
    },
    {
      "name": "multilingualism and the internet",
      "content": "This is my entry for the IndieWeb carnival this month on the topic of Multilingualism in a Global Web. Version en français de l’article ici. ToggleSome background: multilingualism as a side effectDammit, why is this post in English?What do?More of our own languagesCuriosityPost-scriptum: TwitterSome background: multilingualism as a side effect I derive a lot of pride and a lot of cringe from speaking several languages, in the exact same way that I am very proud and vaguely ashamed of being proud of being French. I grew up in Québec, with French parents who were very intent on 1. exposing me to English as much as possible 2. telling me exactly how unrefined and bastardized French Québécois is. I’m really glad that Québec has French protection rules and they were forced to send me to a French-speaking school where I got to interact with francophone kids. Of this, I will only say: Snobbery bad. As a result, my Québécois French is very rusty (it’s been 20 years after all) and I try to listen to québécois podcasts and interact with québécois people as much as possible to regain some of my old fluency. As a kid, I thought I was bilingual, as I spoke both French French and Québécois French. Then, we moved back to France, and suddenly I was bilingual because I spoke both English and French − my English was nowhere near native level, but also very far away from the English spoken by my classmates, and eventually, with a lot of hard work during the holidays, I entered an international high school where most of my friends were native English speakers. By the end of high school, I considered myself actually bilingual. In high school, I was also a skater, and we went to a bunch of international competitions, so I got to work on my Italian, my German, and also my English with a bunch of different accents involved, whether from Great Britain or as the lingua franca. Other languages got thrown into the mix − speaking French and Italian, I understand written Spanish relatively well, and speaking English and some German, I can also make my way through a Dutch text. I’ve spent four months in Shanghai for my student exchange and could actually have a simple conversation in Mandarin by the end of it, which I’ve entirely forgotten since then. I did a year of Russian, which led me nowhere, my only true language-learning failure. I’m very proud of speaking several languages well, and I’m also very conscious that none of my languages come only from hard work. I speak English because my parents put my English skills above everything else (and then my entire work life was geared towards English, and then my social life, and then some of my romantic life as well); I speak Italian because I was so miserable as a teen that most of my friends were from across the border; I speak German because I spent a year there. Being multilingual is really mostly a sign of my financial privilege. Anyway, the stage is set, you know which languages I speak. This has a few consequences as well, and the most negative and pressing one in my opinion is that I’m used to understanding stuff in a handful of languages, so I forget that auto-translate exists and I just ignore things in languages I don’t speak, since those occurrences tend to be rare. This sucks! I need to do better! Two more elements that are absolutely necessary to understand what comes next: I’m patriotic. As in, I’m very much aware that I’m French only because I was born in the right place of the right parents. But also, I wouldn’t live anywhere else in the world (I’ve tried) and I’m incredibly proud of my people. Again, that’s mostly because people 300, 100, or 60 years ago, French or not, did some really cool stuff that set the stage for our social system today. That’s why I get so annoyed when we collectively fuck up, by the way − I’m proud of my country and want to have good reason to be proud. I consider myself patriotic, not nationalist. I worked in localization for a while. The whole point of my job was to escape the « English as default language on the Internet » paradigm. I even worked on Meta AI’s No Language Left Behind initiative on endangered languages. Dammit, why is this post in English? This post, like many others on my blog, is in English. The main reasons: more of my readers speak English than readers who speak French, either as a first or foreign language. at this point in my life, about half of my thoughts are in English because my job is in English, my blog post consumption (but not news consumption) is in English, and pretty much all of the videos I consume are in English. the prompt was in English so I realized mid-way through the introduction that I could technically not have written the answer in English. The Internet was designed as « not a place ». The whole thought behind the Internet was to remove all boundaries, all frontiers, all physical constraints. My CEO is going to love this because he uses any chance he gets to quote the declaration of independence of the cyberspace and now I’m doing it too: Cyberspace consists of transactions, relationships, and thought itself, arrayed like a standing wave in the web of our communications. Ours is a world that is both everywhere and nowhere, but it is not where bodies live. And since I’m aping my CEO already, let me keep going: to this declaration, we reply that data needs to be material again. We need to create places on the Internet, not put it in the open as an abstract concept without limits. The cozy corners of group chats are our vague solution − in my group chats, I can speak French knowing that non-French-speakers will simply not be there − but they don’t solve the question for the Internet as a whole. I think what comes closest to places right now is Fediverse instances: on Lemmy, I have an account on the French-France instance jlai.lu and can interact with non-French and non-France instances and communities, while still signalling that I’m from this instance. You know where I’m from. If I choose not to be from French-France, I can choose to be from gay or from Linux or from communism; in my case, the geographic and linguistic instance was what brought me the most solid sense of identity, and I chose that one. The more I think about it, the more I think my issue has never been English as a dominant language so much as American cultural hegemony. Because to be fair, I don’t mind news about France that are in English (I crave them, in fact, because they usually offer an interesting outside perspective), but news in French about the damn political election in a country a continent away are at least as aggravating than when they’re in English. In other words, English-World is fine, French-World is great, English-France is fun, French-USA is insufferable. I hope this rambling made you understand my meaning: in localization, we use four-letter locales and not two letters (fr_FR is different from fr_CA which is different from fr_BE, itself very different from fr_DZ) because language matters but so does cultural context. And currently, the Internet tends to flatten both of these, so we conflate « English as the main lingua franca » with « how horribly and depressingly flat the Internet sometimes feels ». What do? I don’t know! But let’s try. More of our own languages We can focus on our own languages, by trying to keep our blogs balanced. Or we can decide that our blog will only be on our own language: for 10 years, with Réussir Mes Études, I decided that I would only write in French, specifically for people who couldn’t or wouldn’t check English-language resources. I’m really proud of that one, because it was one of very few resources in French especially in the early years. (It also made my blog a big fish in a small pond, where I would never have gotten a living wage from the same blog in English, so the incentive to do this isn’t only personal values, if you’re monetizing.) We can remember that most people who have the resources to read what we write also have the resources to throw it into DeepL or another translation engine, so we may not need a lingua franca anymore. I’m always very happy when Sara takes the time to send me an email or comment in French, and I’m also happy to throw her Slovenian posts into a translation engine. In that way, we can fight the assumption I made above of « people speak English more » − unless what I’m saying takes a great deal of nuance, they’ll understand well enough with auto-translation. We can take the time to translate our blog posts ourselves (I did this on my news consumption article) and to translate worthwhile content by other people into our language. We can make sure that our companies translate their assets and documentation into at least one non-English locale. We can participate in our own language’s space: try to always reply in our own language to someone from our linguistic background, maintain a blogroll for our language… (If you know a blogroll in Italian, by the way, please tell me: it’s been hard to find good stuff in Italian (including podcasts and videasts!) and I wish I had more opportunities to practice.) We can also ask WordPress to support multilingual blogs instead of relying on a mediocre tagging system, but I haven’t fixed that one yet! Curiosity For those of us whose native language has spread across the world through colonization (and, by the way, is still enforced by neo-colonialism), it may be time to dive into how our language evolved and what interesting use is made of it outside of our cultural sphere. For French, here are some resources I enjoyed: music changing French in Côte d’Ivoire, P’tit Belliveau’s songs in Acadian, Louisiana French making a comeback… If we like to learn new stuff, we can get into esperanto if we speak a European language. We can be curious about fun languages like toki pona. We can « simply » get the basics of a new language, just because. We can also do a bit of techno-optimism (yes, yes!) and dive into a whole new AI-enabled language preservation world. And when we encounter a cool bilingual blog, we can try and auto-translate the posts to open ourselves to a whole new part of the Internet. Post-scriptum: Twitter A few times along the 2010s, I tried to create an English-language and a French-language Twitter account so that people could easily follow one or the other. I always ended up abandoning the English-language one, because it turned out that for most of my Twitter activity, I mostly wrote in French but more often replied in English, and maintaining two accounts was very confusing. Twitter’s dead to me now, but I thought that was interesting and didn’t know where to put it in the article. Here it is. https://alexsirac.com/wp-content/uploads/2023/01/cropped-cropped-cropped-portraitplante-100x100.webp",
      "author": "Alex",
      "authorUrl": "https://alexsirac.com",
      "date": "2024-10-13T13:40:17+02:00",
      "url": "https://alexsirac.com/multilingualism-and-the-internet/",
      "type": "unknown"
    }
  ]
}