{
  "replies": [
    {
      "name": "Weeknote 2025-W48: CLI usage \u0026 Hong Kong Tai Po Fire",
      "content": "Only a brief weeknote this week.Tech LogWeeChat (IRC client) is not working well with Soju (Bouncer Server). It was spamming my channels with many JOIN/PART spam which was infuriating and impossible to prevent it seems on the Mac. While Goguma on Android worked flawlessly and took literally only 1 minute to set up. I eventually realized WeeChat doesn’t have great support for bouncer servers, so I switched to Senpai which has a similar look (CLI-based) but is much more straight forward to use. I regret not trying it first! It was built to work with bouncers. Another three (web-UI) clients I was going to try if Senpai didn’t work out:ObsidianIRCKiwi IRCGamjaAdditional reading: senpai: a modern IRC terminal client | Hugo IRC Bouncer Setup With Soju, Gamja, Caddy and Docker | Henrique DiasI have been spending time with the Mac terminal a lot more in the past year or two, and I’m starting to wonder if I should try another terminal emulator like iTerm2. What is your daily driver? From a quick search online, I came across Alacritty and Kitty, but I think iTerm2 is going to be the easier one for me to get into grips with being a CLI novice.Installed jrnl, a plain text journalling CLI app. It’ll come in handy for quick jot-downs, as it has a low barrier of entry, especially now that I have the terminal often running. What exactly I’ll use it for—I don’t know yet. I’ll probably be making small notes about completed jobs, random ideas, or notes while troubleshooting bugs.I came across Black Friday Create Day on the IndieWeb chat IRC channels. Unfortunately, I didn’t get the chance to join the event, but I came across a links page (link in bio) by artlung which got me thinking about mine. I haven’t touched mine since I started on my Hugo blog (it’s still a page on my WordPress blog); wondering if I should move that over here. I know there are some really clean and minimalistic Hugo themes for one-page sites/landing pages or even just hand-coding one now that I’m much more comfortable with HTML/CSS. Something to investigate on a rainy afternoon, I reckon. Update: New link-in-bio is out!Quite happy with my new Open Graph image generation workflow. I updated the post with the upgraded script and it’s been working really well so far!IRL (In Real Life)I was asked by @joelcrono to collaborate on a special post of his. I wrote my submission and I look forward to reading his final post. I don’t know if I’m allowed to reveal the topic, so I’ll just keep it under wraps for now. Update: Joel published the post—Desert Island Game, which features just under 20 gamers’ choice of game to bring on a desert island. Happy to contribute to a cool post like that, thanks Joel.As you may have seen on the news, there has been a devastating fire that broke out in the Tai Po district of Hong Kong, across 7 (out of 8) buildings in an apartment complex. As of today, about 6 days after the fire, the death toll is up to 151, with searches in the scorched buildings still being conducted to find the remainder of the missing persons. It’s been a very heavy week for all Hongkongers. RIP to all the victims and hope affected families stay strong. There’s a lot of misinformation flying around in the media, which is frustrating. For example, blaming the rapid spread of the fire on the bamboo scaffolding itself is incorrect—the main factors were the surrounding netting (cheap, non–fire‑proof material) and Styrofoam used to cover windows (apparently to protect the windows). Another failure was the lack of alarms. As someone who admires bamboo scaffolding, I’m very disappointed to see it blamed. Bamboo scaffolding is a true craft with a deep history in Hong Kong’s development, going back over 100 years. Additional reading: A Visual Appreciation of Hong Kong’s Bamboo Scaffolding | Atlas Obscura",
      "author": "Naty S",
      "authorPhoto": "https://avatars.webmention.io/burgeonlab.com/a10e5d6ceaef2e93e66c882278be624653dff2adb73155560a02d7b490ba0c6a.png",
      "authorUrl": "https://burgeonlab.com/",
      "date": "2025-12-01T20:36:36+08:00",
      "url": "https://burgeonlab.com/weeknotes/2025/w48/",
      "type": "unknown"
    }
  ]
}