{
  "replies": [
    {
      "name": "Favorites of January 2023",
      "content": "A week late, but hey, better late than never. It’s been a year since I’ve been posting monthly flashbacks, and I’ve been thinking about skipping them all together. It never felt right to write a few paragraphs about my personal or professional life that either aren’t worth being promoted to a full-fletched post or do not evoke a feeling of fun. Yet having this overview will no doubt later be of value as it helps shape that personal Zeitgeist. That’s why I’m trying out a slightly different approach, where the link sharing aspect is brought to the center stage. Other bloggers solve this by an endless stream of likes, favorites, and links to be pushed online next to regular posts, which doesn’t work for me. I’d rather curate and present them in a monthly fashion; cherry-picking is up to you, the reader. Feel free to object. Previous month: December 2022. Books I’ve read I did a very stupid thing last month: after stumbling upon a positive review on another indie blog and forgetting to save that link, I rented Bram Stoker’s 1897 Dracula. The review I encountered contained nothing but praise, but I now realize that would have ben an author who’s mother language is English. Stoker’s stiff writing style—as it was back then?—combined with the diary entries of the Dutch vampire hunter Abraham Van Helsing that purposely contain unconjugated verbs and weird sentence constructions made for a very tough read. It’s written as a series of letters which I was unfamiliar with so that was interesting. In the end, I was glad it was over: the pocket edition is 516 pages and the end keeps on dragging on. That said, Stoker’s iconic Dracula reappears almost everywhere nowadays: in my beloved Castlevania games; in movie series; in other novels; … I’m happy to have read one of the Originals (see what I did there?), although I’m aware it’s not the first novel where a blood-sucking “vampyre” plays a role. A surprisingly minor role, by the way. 3/5—Good. Games I’ve played We’re continuing the vampire theme here. After the lackluster Albion RPG that was December’s DOS Game Club game, I yearned for a proper first-party “blobber” and revisited one of the first PC RPGs I came into contact with twenty-three years ago: Might \u0026amp; Magic VIII: Day of the Destroyer (or just MM8). I took extensive notes and screenshots during my playthrough which can be followed along with the link. MM8 has a high nostalgia factor for me, but it special in another kind of way: in it, you could visit pubs and play a card game called Arcomage that’s been fully rebuilt as Arcomage HD on GitHub! Be sure to give it a go, it’s not difficult to understand and has a lovely vibe to it. Playing a game in a game is the kind of meta stuff I love. Also, I created a dual wielding vampire—that ultimately never lived up to Stoker’s Dracula potential: even a mediocre knight would have been a better character. Nonetheless, I had fun revisiting the world of Jadame. A round of Arcomage in the tavern of Ravenshore.I intend to continue the vampire hunt with a second look at Castlevania: Anniversary Collection on the Switch that’s been lying around for more than a year now. Selected (blog) posts When You Don’t Know the Ingredients, where Henrique Dias tries to cook a Portuguese meal in Eindhoven and fails to find the exact ingredients. Via Mark Hurst’s new year resolutions, I learn that Adobe is collecting your pictures for machine learning purposes? This extremely bad behavior in tech is very, very, very worrying! That same Mark informs us about Google profiting from criminal activity. Again, very worrying. Anything big tech related makes me sick lately. Nolan Lawson retired the Pinafore Mastodon client, but alternatives are already popping up. Thanks for all the hard work, Nolan! In case you weren’t aware yet, Wizards of the Coast is screwing with the D\u0026amp;D license, but fans managed to successfully revert their intentions. They recently even announced parts of it were going to be open-sourced. Kelson Vibber summarizes how to find Fediverse feeds in case you want to follow people but not create yet another social media account. Justin Etheredge shares 20 things he’s learned in 20 years of software engineering. Good advice, but nothing unexpected. On the Fediverse, we’ve had a PNG vs WEBP vs JPG discussion a few times, and then I read Hello, PNG! by David Buchanan. Now I’m convinced: PNG’s format is superb, although I’ll stick with optimized JPGs. Why? Because my retro hardware can interpet JPGs. What Is Philosophy? Who Cares? Good questions answered in a CSS/HTML flashy way by Kevin Litman-Navarro. I love what Tim Rodenbröker does: to help people learn programming by leveraging Creative Coding. “Full Stack” development is a fraud: you’ll never be a full stack developer says Laurie Voss. I love his point of view and couldn’t agree more. Other random links Remember the nineties Furby things? Njam Njam! Here’s the archived Assembly source code in a 297-long scanned document. The fun lasted for about two minutes. Yet another tool I need to try out (and I know it’ll probably never happen): Dagger, a CI/CD pipeline as Go code system, in case you’re getting tired of YAML-ing your current CI build. Kunst Vensters is a Dutch news and info site related to all things painting. It has RSS and new entries every odd day, which are great reads. This is probably old to most of you, but Andy Bell has a series of websites dedicated to “building excellent websites” (or fully responsive) at https://buildexcellentwebsit.es/ and https://every-layout.dev/ and https://cube.fyi/. His be the browser’s mentor 2022 talk was very informatie. I can see yet another CSS redesign coming. Have you seen this (old by now) Android resolution fragmentation figure? tags icon metapost",
      "author": "Wouter Groeneveld",
      "authorUrl": "https://brainbaking.com/",
      "date": "2023-02-07T00:00:00Z",
      "url": "https://brainbaking.com/post/2023/02/january-2023/"
    },
    {
      "content": "In the beginning of the month, I wrote about being a foreigner in the country you’re living in, and the struggles we have to find ingredients to make dishes from our home country. It can be so frustrating! And well… it happened again!Yesterday, I was making Arroz Doce 🍚, which literally translates to “sweet rice”. It is a Portuguese rice-pudding-like dessert. It asks for arroz carolino, which is a rice only cultivated in Portugal. That would be quite hard to find, so I checked a Dutch recipe and they said I could use dessert rice instead. I tried it, the taste is there, but the consistency is very far away from what I expected. The grains are so much smaller and it’s barely noticeable it is rice. Next time it’ll be better!Also, fun fact: Portugal has the highest rice consumption in Europe and we cultivate our own rice. You can read more about it if you’re interested.",
      "author": "Henrique Dias",
      "authorUrl": "https://hacdias.com/",
      "date": "2023-01-28T09:52:50+01:00",
      "url": "https://hacdias.com/2023/01/28/when-the-rice-isnt-right/"
    }
  ]
}