{
  "replies": [
    {
      "name": "Mijn Apple Music Replay'23",
      "content": "Henrique zit me al een paar dagen achter mijn broek aan dat ik mijn Spotify Wrapped moet delen. Uitleggen dat ik op Apple Music zit hielp niet: prompt kreeg ik links van blogposts waarbij juist Apple Music Replay werd gedeeld. Dus ja. Mijn grootste probleem ermee is dat ik me niet genoeg identificeer met muziek, en dat ik het niet vaak genoeg luister. Ik heb wel Apple Music, maar juist om gewoon even wat op te zetten. Vaak luister ik naar de playlists van Apple, en ik heb vrijwel geen enkele zelf-gecureerde playlist. Mijn \u0026#39;milestone\u0026#39; van 2500 songs heb ik aldus het overzicht pas op 11 oktober gehaald. Ik weet niet wat de volgende mijlpaal is na 10.000 minuten, maar aangezien ik die op 8 augustus haalde vermoed ik dat ik onder de 20.000 minuten voor het hele jaar zit. Verder kan ik me ook niet zo vinden in de top-5 lijstjes. De nummer 1 song (Dream 1 (before the wind blows it all away [Pt. 4]) van Max Richter) heb ik kennelijk 11 keer afgespeeld, maar herken ik verder totaal niet (misschien per ongeluk op repeat en in slaap gevallen?). De nummer 2 song klopt wel (What Was I Made For? van Billie Eilish, 9×), want die stond op repeat tijdens een kleine episode van liefdesvertriet. Mijn top-albums zijn ook een lachertje: op nummer 1 staat de soundtrack van Succession seizoen 4, met 51 plays en op 2 staat een DJ mix van Trixie Mattel met 40 plays. Voor context: de soundtrack heeft 25 nummers, de DJ mix 20. Twee keer luisteren en je staat op 1. Mijn top-artiest is uiteraard De Kift en dat is gewoon terecht. Maar als ik iets meer zelf mag kiezen, hieronder de héle top 15 aan artiesten, zoals gegeven door mijn Apple Music Replay, maar met toelichting. Daar weer onder mijn \u0026#39;gecureerde\u0026#39; top 20 aan songs, gebaseerd op data van Apple, maar met wat skips. Artiesten De Kift 350 minuten (terecht op 1, ik hou hiervan) De Jeugd van Tegenwoordig 234 minuten (nieuwe en oude albums een paar keer geluisterd) Arctic Monkeys 162 minuten Thursday 159 minuten (weilen Jonas Neubauer, de Tetris-kampioen, had dit ooit opstaan op een stream en dus speel ik het af en toe als ik die emo-vibe wil) Spinvis 133 minuten (gewoon fijn) Sufjan Stevens 126 minuten Pink Floyd 112 minuten Death Cap for Cutie 111 minuten Queens of the Stone Age 105 minuten Nicholas Britell 103 minuten (deze moest ik opzoeken, maar dit is dus de componist van Succession) GALNERYUS 97 minuten (hoofdzakelijk \u0026#39;DESTINY\u0026#39; wat gewoon een fijn nummer is) The Decemberists 93 minuten (mijn auto startte soms \u0026#39;gewoon\u0026#39; muziek en daarbij staat \u0026#39;A Cautionary Tale\u0026#39; op nummer één, want alfabet. Sindsdien zitten ze zwaar in mijn algoritme ingebed, maar voor alle andere nummers vind ik dat niet heel erg ook) Kamasi Washington 93 minuten (ja) Joe Hisaishi 93 minuten (ja) Troye Sivan 91 minuten (voornamelijk Rush afgelopen zomer, denk ik, maar 2.5 × 8 is 20 minuten dus eigenlijk snap ik dit niet) Nummers What Was I made For [from Barbie] - Billie Eilish Dai Zero Kan - 10-Feet Kaikai Kitan - Eve Rush - Troye Sivan Rage on - OLDCODEX Tattoo - Loreen All My Friends - LCD Soundsystem Horizon (Extended Version) - Xinon Ze is pas net begonnen (Leerstage / werkstage) - De Jeugd van Tegenwoordig Black Honey - Thrice The Archaic Revival - Henry Homesweet The Invincible Youth - Kamasi Washington Attack Vector - Covox Body Paint - Arctic Monkeys Understanding in a Car Crash - Thursday",
      "author": "Sebastiaan Andeweg",
      "authorPhoto": "https://webmention.io/avatar/seblog.nl/df346916d2a97b05f18c3fd39e70c55885af4642f71d07b2094aca1d28d5c3cf.jpg",
      "authorUrl": "https://seblog.nl/",
      "date": "2023-12-01T10:29:38Z",
      "url": "https://seblog.nl/2023/12/01/1/mijn-apple-music-replay-23",
      "type": "unknown"
    },
    {
      "name": "My Apple Music Replay'23",
      "content": "In response to James G on Spotify Wrapped Earlier this year I wrote a blog post what I\u0026#39;m listening on repeat. I\u0026#39;m that person who doesn\u0026#39;t use Spotify. I left Spotify a while ago. I instead use Apple Music does something similar to Spotify Wrapped. I honestly didn\u0026#39;t know that Apple Music had a feature to share. Now it\u0026#39;s time for the results my Apple Music Replay\u0026#39;23 (the Apple equivalent to Spotify Wrappted) to shine. It was interesting because I had to launch my browser to get the Replay\u0026#39;23 instead of it being in app. It was easy to share on social media as images. My listens ranged from mid/late 2000s to more recent. I really liked listening to The Submarines. I\u0026#39;m a sucker for the song Brightest Hour. This coming I would like to discover smaller indie bands and attend more concerts to get out of my cycle of repeating and getting too comfortable with the things I listen often. I really like Jo\u0026#39;s Post on what she listened to on Spotify. I love what you listened to this year and how you organized your post! I read Henrique\u0026#39;s Post on what he listened to on Spotify. Het made me remember that I need to give my vinyls a little more love (or a spin) and decrease my listening minutes on my phone. I know I have an interesting taste in Music but I like listening to alternative. Well here you go! Enjoy!",
      "author": "Pablo Morales",
      "authorPhoto": "https://webmention.io/avatar/static.lifeofpablo.com/7eb46c8cf52eff013bce1512fa0d43e0549f87b530e938d661681aad5f73811b.jpg",
      "date": "2023-11-30T00:00:00Z",
      "url": "https://lifeofpablo.com/blog/my-apple-music-replay-23",
      "type": "unknown"
    }
  ],
  "interactions": [
    {
      "name": "Spotify Wrapped 2023 - Henrique Dias",
      "content": "Spotify Wrapped 2023 - Henrique Dias",
      "author": "James' Coffee Blog",
      "authorPhoto": "https://webmention.io/avatar/jamesg.coffee/44a4b81d3ad1303a2acd54e82a33c5333b80a611e540f4971bcb5fd93096c352.jpg",
      "authorUrl": "https://jamesg.coffee/profile/capjamesg",
      "date": "2023-11-30T17:38:40Z",
      "url": "https://jamesg.coffee/2023/spotify-wrapped-2023---henrique-dias",
      "type": "like"
    }
  ]
}