{
  "replies": [
    {
      "name": "Year in Popcorn '22",
      "content": "A few years ago, I published an article where I did a small analysis of my Trakt data, which contains the shows and movies I have watched. I decided to bring that back again under the name “Year in Popcorn”. I considered “Year in Movies \u0026amp; Shows” but I thought that was too long and unappealing 😅.In 2022, I am aware I watched many things, especially TV shows. To say the truth, I feel like I probably watched too many TV shows during the year. However, some of them I also watched on the background while doing something else. Besides, most of the year I was still studying, which made this much easier. Now that I’m working full time, I’m sure the amount of TV shows I watch, or at least the cadence, will decrease.🏁 First and LastThe first thing I watched in 2022 was Episode 2 of Season 2 of Travelers, on the 1st of January at 11:22 in the morning; while the last thing I watched was Episode 10 of Season 3 of Emily in Paris, on the 30th of December at 22:00 in the evening.Agence Grateau in Emily in Paris (Season 3)🎬 MoviesDuring 2022, I watched 45 different movies, having repeated none, except for “Everything Everywhere All At Once”, which I watched two times, in different occasions with different people. My top 3 movie genres are Comedy, Romance and Drama.Top Movie GenresGenreCountPercentageComedy2318.4Romance1411.2Drama1310.4Adventure129.6Action118.8Fantasy97.2Science-Fiction97.2Family97.2Thriller54.0Animation43.2Superhero32.4Holiday32.4Musical21.6Mystery21.6Horror21.6Music10.8War10.8Crime10.8Documentary10.8Then, I decided it would be a great idea to see my movie watching habits in two different perspectives: by weekday, and by month. We can see that, when it comes to weekday, I’m more likely to watch a movie on the weekend when compared to a weekday, especially on Saturday.Regarding months of the year, I can see that the most prolific months are December and January, which, historically, has been when I have a break from University. In addition, every time I go to my parents house in Portugal, we watch a movie together every night, which also contributes to the spike in December.📺 ShowsDuring 2022, I watched episodes from 59 different shows. The show I watched the most was Workin’ Moms with 80 episodes watched. Naturally, the show with the higher number of episodes would be the most watched. My top 3 TV show genres are Drama, Fantasy and Science-Fiction. Drama seems to overlap with movies, too. But the remaining ones not that much!Top Shows GenresGenreCountPercentageDrama3722.2Fantasy2414.4Science-Fiction2414.4Comedy169.6Mystery137.8Action95.4Adventure95.4Reality74.2Superhero63.6Romance53.0Animation53.0Horror42.4Documentary21.2Thriller21.2Family10.6Music10.6Soap10.6Crime10.6Similarly to what I did for the movies, I also plotted how many episodes I’ve watched per weekday and per month. Similarly to the movies, there are more episodes being watched on the weekend. However, there is not a large difference between Saturday and Sunday.When it comes to watching patterns per month, I can’t see any specific pattern. I did watch a lot of episodes every month, so there doesn’t seem to be a specific pattern.Well, this was my 2022 in movies and TV shows, which I called “Year in Popcorn”. I am curious for how this statistics will look like next year. Will I have watched less shows, or maintained? Will the ratio between shows and movies be different? Who knows!",
      "author": "Henrique Dias",
      "authorUrl": "https://hacdias.com/",
      "date": "2023-01-02T14:49:00+01:00",
      "url": "https://hacdias.com/2023/01/02/year-in-popcorn-22/"
    },
    {
      "content": "Hi, have you deleted this project? I so wanted to visualise my data :(",
      "author": "Anonymous",
      "date": "2021-07-29T18:11:13Z",
      "url": "https://commentpara.de/comment/882.htm",
      "type": "reply"
    }
  ]
}