{
  "replies": [
    {
      "content": "My wife, a non-EU citizen, holds a (permanent) Belgian residence permit. She can use it just as any Belgian would use their (regular, and mandatory) electronic ID card. (Nowadays, there’s also an app for this sort of thing, which works quite well.) We do use eIDAS, which we discovered only fairly recently, to file our Dutch tax returns. (In the past, we would have had to mail those in or use basically a password.) Because we’re neither Dutch nor live in the Netherlands, however, we do not have DigiIDs, which means that whenever we need something from, e.g., our health insurer, we still have to request it by phone or (snail) mail, and wait a week or two. Or three.",
      "url": "https://jan.boddez.net/notes/4f8879145f",
      "type": "reply",
      "date": "2022-11-09T21:27:29+01:00",
      "author": "Jan Boddez",
      "authorPhoto": "https://cdn.hacdias.com/wm/ca4a566e8cad11023244978b77560414c826fd6d8db47a9b034e19b8d3d9ffd2.jpg",
      "authorUrl": "https://jan.boddez.net/"
    },
    {
      "name": "Issues With DigiD as a Foreigner",
      "content": "In reply to Issues With DigiD as a Foreigner by Henrique Dias That’s very inconvenient. So what’s the alternative, if you can’t use DigId? Going by in person somewhere, phone based? And will the EU ID efforts help, because those aim at being able to log into gov services across the EU with your own national government e-ID method, iirc?",
      "url": "https://www.zylstra.org/blog/2022/11/22526/",
      "type": "reply",
      "date": "2022-11-09T12:02:20+01:00",
      "author": "Ton Zijlstra"
    },
    {
      "content": "Sinds ik van Henrique een account heb gekregen op zijn Miniflux RSS-reader ben ik weer wat fanatieker aan het lezen en bloggen. Henrique moedigt mij steeds aan om ergens over te bloggen, en ik hem ook. In mijn geval gaat dat natuurlijk nergens over, maar hij komt met uitgebreide analyses van onze nieuwe OV-chipkaart, OVPay, en problemen met DigiD waar hij als Portugees in Nederland tegenaan loopt. Volg en lees.",
      "url": "https://seblog.nl/2022/11/09/1/volg-henrique",
      "date": "2022-11-09T07:34:40Z",
      "author": "Sebastiaan Andeweg",
      "authorPhoto": "https://cdn.hacdias.com/wm/ca93193405eccf77606894aca6f634961e036086c5857dd8cf154107345190c0.jpg",
      "authorUrl": "https://seblog.nl/"
    }
  ]
}