{
  "replies": [
    {
      "name": "IndieWeb Carnival roundup: Cycles and Fluctuations",
      "content": "As the monthly cycle of the Indieweb carnival has come to an end, I’ve procrastinated a bit but here is, finally, the roundup! 22 people participated and made 23 blog posts on the topic, with lots of opinions that sometimes crossed each other. Let’s go through them! TogglePersonal energyFluctuations in writingPassions and activitiesImperfect circlesThe weatherTimed milestonesThe linguistsCycles of powerPersonal energy But, older me knows when you hike up the mountain, you use the plateaus for what they are meant for. − Throwing off my groove, by Bobby Hiltz I talked about cycles and about fluctuations, but I didn’t include stability, because I too forget to take time off and pause the cycles once in a while without necessarily needing to start new ones. What a great insight! My days are slightly different. Long covid forces me to divide the day into smaller cycles of roughly 1½ hours of activity followed by 15–20 minutes of rest. On the bright side, this gives me at least eight chances each day to start a new cycle. − Cycles and Fluctuations, by Ruben Verweij Long covid is awful. I do like the approach of many mini-cycles during the day, though, and the doors that it opens, as small as they may be compared to the ones that have closed. It’s tough to identify potential cycles, or patterns in any fluctuations from baseline functioning, when your memory just doesn’t keep track of things in the “right’ way. This, too, then becomes an example of how I’ve used the blog as an extension os my own cognition, the way I use my phone for planning and reminders, and the physical extent of my own body to make up for a lack of spatial relations and movement coordination. − On Cycles And Fluctuations: Bears, Birthdays, And Burnout, by Bix Frankonis An amazing exploration of autistic burnout, with very relatable parts, and also a polar bear. Fluctuations in writing Sometimes the smart thing to do is to take a break. Doing something completely different usually helps get tangled mind untangled, to get some distance between yourself and the problem and to see things from new perspectives. But it’s hard to do when I still want to write. And I’ve gotten quite attached to my weekly blogging streak — which probably is the sign that it needs to break because streaks can become obsessions and obsessions are rarely good for you. − My writing inspiration lives through cycles, by Juha-Matti Santala I definitely relate to this, both in terms of it being hard to take a break even when you need it the most and in terms of easily getting obsessed with streaks rather than the results. It’s not about feeling, for me. I have to be. I have to enter the cycle, then I will get picked up by it. − The washing machine cycle of creativity, by Fran Sometimes you might need to « eat the frog » for a minute indeed. One part of our ADHD support club was about learning the 5-minute timer method: if you don’t want to do a task, and your brain struggles with task initiation, put a 5-minute timer and promise yourself that if you’re still not into it, you’ll stop when it rings. 30% of the time the washing machine cycle works well enough that I’ll carry the task to completion; 30% of the time, I find out that I vastly overestimated the task and it didn’t even take 5 minutes to complete; and the rest of the time, I’ve made 5 minutes of progress on something I wasn’t going to do at all. Passions and activities I’m very passionate about one thing today, only to forget it exists for the following eight months. We’re humans living in a mostly-digital world where we’re bombarded with thousands of little pieces of informations each day, with social media “helping” us microdosing dopamine. And it’s okay to feel tired, and it’s normal to feel overwhelmed. You’re not mentally ill, you’re just stuck in a bad cycle. A cycle which you can break. Which you must break. − Cycles and Patterns, by Andrei Outside of the few snide remarks about ADHD (which I didn’t choose to have, I promise!), a very good post with a great list of passions and activities. [Machine-translated from Slovenian] I notice in all my hobbies how I have periods when I devote more time and energy to something and less. And then, after a while, I’m back to these topics. Let it be mathematics and logic (what I am currently satisfying with programming), learning foreign languages, dancing, reading, writing, understanding people and others. − Vračanje k mojim zanimanjem by Sara Jakša Great thoughts about hyperfocus and about our relationship to hobbies. Then I heard someone say I was just riding the Hobby-go-round. − Riding the hobby-go-round, by Patricia Oyson-Matthan Amazing! I’m this close to printing out the set of rules for when I’ll inevitably change my area of interest in a few weeks at most. Imperfect circles I believe not all cycles are perfect circles. There are moments in life that will never come again, once-in-a-lifetime phases. Some cycles are oval, with troughs and crests, peaks, trenches, and plateaus of wins and failures, love and hatred, birth and death, both of those close to us and those unknown whose actions still affect us deeply. − The endless cycles of life, by Arun Cycles are not circles, that’s true, and considering them this way can lead to negative unintended consequences. Great thoughts about this. I am not regimented about having a morning routine at certain times any more – if I read a bit more or less, that’s okay. If I start breakfast a bit later than normal, that’s okay, too. I am also not sleeping in, either. − Routines, by JamesG I used to have a morning routine which I would never follow, then always beat myself up for not following. These thoughts make sense to me, and while I hate coffee with a passion, I do love whenever James talks about coffee, and it’s very much the case here once again. The weather Even though I find the dark months difficult I do find the cycle of sunrise and sunset, equinox and solstice very comforting. A cycle we can plan by, a cycle so far beyond human ability to change, one we celebrate and mark in many ways around the world. It’s a bit of a reminder that we all share this place and we should look after it. Each year is unique, the seasons change, but the cycle of solstice and equinox is constant. − The personal season, by Britt Coxon I loved this take. Even in the city, it’s easy to pay attention to these fluctuations. You might not know when bears start hibernating in their caves (kuma ana ni komoru), but you know when your neighbours start closing their windows and lighting candles. Sekki might just be the antidote we need to the dreary monotony of the passing days and the growing inadequacy of our four seasons. − ’tis the (small) season, by Z1NZ0L1N Being in Paris right now, I’m fascinated with this and very curious about the other mini-seasons. (Also, it was very hard to choose whether this belonged in « weather » or « linguists ».) The phase of the moon impacts the gravitational forces on the water on planet earth; the time of the year impacts gravity and season, which impacts weather systems, temperature and wind flows, which are transmitted to the water. And each spot where the wave meets the land is impacted by rock and sand, pier and jetty: EVERYTHING. And all of it contributes to whether a guy who makes web pages has fun in the water. − Cycles, fluctuations, by Joe Crawford I remember first being told that surfing only happens in the winter and being so shocked, and yet, everything makes some kind of sense when you think about it. Love these cycles that are invisible to someone who wouldn’t have a specific activity or knowledge or constraints. Timed milestones The days around the New Year is naturally a self-reflective time. Resolutions are a trend that attempt to change course, but without the understanding of how those steps take you to where you want to go, or why you even want to be there. Without that, we flounder to maintain our resolutions, especially once the habits we are trying to build become grueling. − New Year’s Self-Reflection: Resolutions Revolutionized by Errant I love auditing my year in December (and should get started soon, too!) and the questions suggested by Errant in this post are going to guide me this year. Also, some great thoughts about resolutions and this period of the year! Coffee in hand while looking out my kitchen window, I saw the last few leaves from my oak tree land on the tall pile in my front lawn. “Felicidades a mi”, I whispered as I dreaded starting my birthday with an unpleasant chore. − Cycles and fluctuations, by Ana Olivia So many experiences in just one twelfth of a month, and it’s beautiful to see them all laid there. [Machine-translated from Slovenian] When I walk around abandoned houses, I think about how wasteful all this is. All these houses, all these hotels, in places most close to the sea, where people can enjoy the view of the sea and wake up to the sounds of the waves. However, all this has been abandoned for more than six months. In the summer, people pay good money for this privilege, and the rest of the year is alone. − Obala duhov, by Sara Jakša I sometimes wish I could go to the mountaintops anytime I wanted for a few days, then realize that these few days would always fall at the same time of the year, so I choose day trips or camping/hotels. Temporary housing kind of sucks, exactly for this reason. Francis Cabrel made a song about it, called Hors Saison, which breaks my heart every time I hear it. Finally, I haven’t really been able to pull a unified representative quote, but Cycles and fluctuations, by esgeroth, is really interesting. Esgeroth lists a few November fluctuations, with special emphasis on the chicken coop’s automated doors, which I thought was a surprisingly fascinating insight! The linguists Nagori comes from nami-nokori, beautifully translated as “remains of the waves”. Have you ever walked along the beach, in that magical place where the water glides over the sand, where you can feel the coolness of the water on your toes? By the time you register the sensation of the cool, salty water on your skin, the water begins its journey back to the depths from which it came. It’s relaxing, it’s welcome, there’s a wish to freeze time while also knowing that time only moves forward, you pause, you notice, you honor the moment, it’s over. − Where the tide speaks, by Crystal Touchton Gorgeous. In toki pona much is open to interpretation, thanks to its very small vocabulary. « tenpo » means time or anything to do with time and « sike » means circle, circular, round, wheel and the like. Used in combination it’s usually interpreted to mean « year ». The year is a time that runs in a circle, a cycle of repeating events. − Cycle of life and death, by Jo Toki pona is so fun, and I love when it falls into poetry like this. Some language changes have been observed to happen in cycles.1 I have a story like this for you: It’s about one linguistic cycle that is among the earliest to have been recognized as a cycle, and arguably the most well-known. − The (un-)Jespersen cycle, by Preterit.me Absolutely fascinating, I learned so much! Cycles of power Humans invent technology. It eases their lives. Then it becomes their lives. Those who wield the tech then control and influence these lives. − Cycles and Fluctuations, by Jatan In normal circumstances, the Netherlands elects a new government every four years. However, fluctuations may happen, and have happened. As a consequence, new elections have been held last week. − Cycles and Fluctuations, by Henrique Dias How many times must a series of events repeat before it may be recognised as a cycle? Once. At least as far as history is concerned, waiting for more examples without learning from the few we do have borders on idiocy. − Fascist cycles, by V.H. Belvadi I didn’t expect two of you to talk about fascisation, although the current state of the world shouldn’t make it too surprising. I read and enjoyed all your entries and updated the beginning of month post as I went. I hope I didn’t forget any! https://alexsirac.com/wp-content/uploads/2023/01/cropped-cropped-cropped-portraitplante-100x100.webp",
      "author": "Alex",
      "authorUrl": "https://alexsirac.com/author/alex/",
      "date": "2025-12-16T15:59:11+01:00",
      "url": "https://alexsirac.com/indieweb-carnival-roundup-cycles-and-fluctuations/",
      "type": "unknown"
    }
  ]
}