{
  "replies": [
    {
      "name": "Finding Stuff on Big Blogs",
      "content": "I noticed a few days ago that my Pagefind installation, the tiny search tool I use to enable searching on this website, was out of date—so I updated it and made some adjustments as to what to index. It now supports custom placeholder translations so that’s great. But Pagefind is a Javascript-only plugin, so what happens when people disable JS? They lose the search functionality and are greeted with a miserable “I’m sorry” message wrapped in a tag. That’s less than great! Then it occured to me, if JS is disabled, I could simply revert to using DuckDuckGo as my external search engine, like Ruben Schade uses by default on his archives page. This principle fits neatly the idea of website fidelity that Jim Nielsen is super intrigued by, or what we in the software development world would call “graceful degradation”. The only downside now is that the results are presented elsewhere. Then I wondered—how do other bloggers help their visitors find stuff? This problem is especially relevant on bigger blogs that have been writing for a while. I’ll try to give an overview. Matt Webb wrote about helping readers find a way on his blog for a specific set of articles regarding the multiplayer web. He came up with a hyperlinked map that visualizes and emphasizes the interconnectedness of certain individual blog posts. This reminds me a lot of Obsidian’s graph view that is auto-generated if you publish to the web using their service. What’s more interesting, however, is the bottom part of the link to Matt’s Interconnected blog, that redirects the reader to various outer sections of his blog using the following links: More posts tagged with (x); A list of most recent posts where the current one is highlighted if applicable; Continue reading: all in (year); New? start here: best of (prev. years); explore the archives: on this day; A list of archive by year; A search bar; The “on this day” links are a fun way to do some random spelunking on blogs. I especially enjoy Frank Meeuwsen’s On This Day that links to articles of several months and years ago. They do not share a topic but just happen to be written on that day in another month/year. Of course, this is only interesting if you have been writing for a long time. My search bar and archive list is tucked away in /archive—otherwise you run into the risk of having a below-article section that’s larger than the article itself. Speaking of archive, I remodeled the tag list it inspired by Ton Zijlstra’s multi-column blog index. My archive page also comes with a year list and a short sentence describing the general mood of that year inspired by an older version of Ruben’s archive page. Others just dump a link to every single article they’ve ever written in their archive page, which is in line with Jeff Huang’s guidelines to design pages that last: don’t use pagination. That’s good advice that’s simply not feasible for blogs with a huge repository of writings. Take a look at Jim’s blog homepage: it contains three article links for the following categories: latest, popular this month, hacker news hits, and personal favorites. That’s another interesting way to direct newcomers to Matt’s “best of” posts. Roy Tang adds recent links to this list, but these are outbound links and not ways to help find stuff on-site. Luke Harris displays previous and next blog posts at the end of his articles, which are not necessarily related. Sebastiaan Andeweg’s blog has a sidebar that contains recent blog posts, split into Dutch and English. This disappears after you click through. James\u0026#39; Coffee blog has an old skool sitemap link on the bottom of each page, listing all the “parent pages” of his site, next to a archives link that simply yields links to different months containing posts. There’s a search bar on the top right of each page though. By the way, James wrote his own search crawler in Perl. If you have too much stuff going on on your site, why not hide it in a “more” link, like Henrique Dias does or Kev Quirk? It’s debatable whether or not this helps visitors find stuff, but it does make it a lot more fun to navigate and discover semi-hidden features. I think “more” is actually just “sitemap”, but whatever. What about related articles? My blog currently displays up to three related articles that share tags, but I’ve implemented true backlink support for other sites as well. Matt tackles this using tags as well. As for site navigation, some like James Ravenscroft repeats these links at the very bottom of each article so that users don’t have to scroll up if they’re interested in more. Others use a sticky navbar to circumvent this, but that’s stealing precious screen estate from your reader, and I’d advise against it. It’s interesting to think about: what will you display below your blog post to help navigate your visitors to related stuff, if any? What kind of search strategy are you going to implement? Or do you like linking to others right below or next to your own content? Is your archive page easy to understand? Will you paginate lists or not? What should be displayed on your front page? Are tags really that useful? Are you going to back-link or forward-link? Will there be a best-of summary each month or year that’s easy for people to find? Oh, and don’t neglect your RSS subscribers! Will you be adding a specific footer that links to related articles for RSS entries as well? Am I overthinking this? Maybe, but that’s what this place is for, isn’t it? tags icon blogging searching",
      "author": "Wouter Groeneveld",
      "authorUrl": "https://brainbaking.com/",
      "date": "2022-11-11T00:00:00Z",
      "url": "https://brainbaking.com/post/2022/11/finding-stuff-on-big-blogs/"
    }
  ]
}