{
  "replies": [
    {
      "name": "BlockLearning Framework Paper",
      "content": "My thesis, specifically the part regarding Vertical Federated Learning, has been turned into a paper which has been presented during the UbiSec 2022 conference. Now, it has been published. It is called BlockLearning: A Modular Framework for Blockchain-Based Vertical Federated.AbstractFederated Learning allows multiple distributed clients to collaborate on training the same Machine Learning model. Blockchain-based Federated Learning has emerged in recent years to improve its transparency, traceability, auditability, authentication, persistency, and information safety. Various Blockchain-based Horizontal Federated Learning models are to be found in the literature. However, to the best of our knowledge, no solution for Blockchain-based Vertical Federated Learning exists. In this paper, we introduce BlockLearning, an extensible and modular framework that supports Vertical Federated Learning and different types of blockchain related algorithms. We also present performance evaluation results in terms of execution time, transaction cost, transaction latency, model accuracy and convergence, as well as communication and computation costs when BlockLearning is applied to vertically partitioned data.Citation@InProceedings{10.1007/978-981-99-0272-9_22, author = \u0026#34;Dias, Henrique and Meratnia, Nirvana\u0026#34;, editor = \u0026#34;Wang, Guojun and Choo, Kim-Kwang Raymond and Wu, Jie and Damiani, Ernesto\u0026#34;, title = \u0026#34;BlockLearning: A Modular Framework for Blockchain-Based Vertical Federated Learning\u0026#34;, booktitle = \u0026#34;Ubiquitous Security\u0026#34;, year = \u0026#34;2023\u0026#34;, publisher = \u0026#34;Springer Nature Singapore\u0026#34;, address = \u0026#34;Singapore\u0026#34;, pages = \u0026#34;319--333\u0026#34;, isbn = \u0026#34;978-981-99-0272-9\u0026#34; }",
      "url": "https://hacdias.com/2023/02/16/paper-blocklearning-framework/",
      "date": "2023-02-16T12:00:00+01:00",
      "author": "Henrique Dias",
      "authorPhoto": "https://cdn.hacdias.com/wm/1c77ad330ad31eb2245e95ab1e1ca542f9a7696c028fdf02044b60022a905dd6.jpg",
      "authorUrl": "https://hacdias.com/"
    }
  ]
}