{
  "replies": [
    {
      "name": "Ten pointless facts about me",
      "content": "I saw a few people in my newsreader do these posts (Henrique, Kev, Manu), and as I have nothing better to say but feel the urge to blog something, here’s my entry to this little blog challenge. 😄 Do you floss your teeth? Yes, but just rarely. I should do it more often. So far, my teeth are good, but I should floss them more frequently to keep them in good shape. Tea, coffee, or water? Never coffee, as I don’t like the taste. Tea only occasionally. But 95% or more of the time, I just drink tap water. Tap water counts as the most controlled food in Germany and often also has better quality than bottled water. I have a huge 2-liter water bottle I fill and try to empty over the course of 24 hours. Stay hydrated! Footwear preference? At home, I sometimes go barefoot but typically wear slippers. Outside, I prefer sneakers. I currently have a pair of Adidas sneakers, but when it gets colder, I will switch to some light winter hiking boots from Decathlon. Favourite dessert? I really like cinnamon buns, as my fiancée sometimes bakes them. But around the end of the year, one of my favourite sweets is Baumkuchen with chocolate or Baumstriezel on the Christmas market. The first thing you do when you wake up? It’s a bad habit, but I usually check my phone and read a bit of news. Age you’d like to stick to? I’m currently 26. It’s a great age regarding available money, possibilities, etc. But physically, my peak was probably five years ago. I can already feel my physical decline. But two days ago, I decided that I want to do more sports again. This morning, instead of reading news in bed, I went up and did another workout. How many hats do you own? It depends on what counts as a hat. According to a strict definition, I have one hat, my Tilley, which I really like. But I only wear it in the summer. Other than that, I have a single sun cap and two or three winter caps. But as I have a pretty big head, it’s not so easy to find hats or caps that fit my head well. Describe the last photo you took? It’s a photo from the package of a printer, which I just sold on eBay today and had to bring to a post office. Worst TV show? I don’t really remember. When I don’t like a show or movie, I just turn it off and watch something different. As a child, what was your aspiration for adulthood? The oldest memory that I have regarding my aspiration for adulthood is that I wanted to become a cook in Denmark (whyever Denmark?). But in secondary school, I quickly came to the conclusion that I want to become a programmer. That plan worked out. Thanks to David for starting this challenge! Feel free to check his post for more people that took part.",
      "author": "Jan-Lukas Else",
      "authorPhoto": "https://avatars.webmention.io/jlelse.blog/19f2fafbdb19f3e5addb86026dc15d7c05df8ae2c5c900fe622e73998b08a0e1.jpg",
      "authorUrl": "https://jlelse.blog/",
      "date": "2025-10-27T20:11:13+01:00",
      "url": "https://jlelse.blog/posts/ten-pointless-facts",
      "type": "unknown"
    }
  ],
  "interactions": [
    {
      "author": "Abdu",
      "authorPhoto": "https://avatars.webmention.io/cdn.fosstodon.org/68aa0a59c0cca3fa10f9ecaae5fd3230eddd83fcff80fd20bb5c1546545288a8.jpg",
      "authorUrl": "https://mastodon.social/@bluemix",
      "date": "2025-10-22T11:27:44Z",
      "url": "https://brid.gy/like/mastodon/@hacdias@fosstodon.org/115417079173815803/112140354794494477",
      "type": "like"
    }
  ]
}