{
  "replies": [
    {
      "name": "Indieweb Carnival − Cycles and fluctuations",
      "content": "Through my window, I see trees the color of gold and copper and rust. I see the first traces of snow on the mountaintops. It’s getting colder, but it’s not truly cold yet. My swimsuit is retired, my ski boots not yet out. Classes have resumed and the sun goes down earlier every day. At the farmer’s market, last week was the final tomato week; now it’s all about leeks and squashes, and I try not to buy cabbage, because when cabbage season starts I’ll be glad I’m not tired of it yet. Today, I don’t have a lot of energy. I feel a bit tired, a bit weak. There’s a monthly cycle inside my body, and right now I keep forgetting to take a break when there’s nothing I need more. I’m better at listening and reflecting, less comfortable with chatting and interacting. I’m more careful with how I move, trying to stretch and hold positions that will give me more strength; cardio is out of the question. In a week or two, my energy will be at its peak, and I’ll be happy to give it my all, while needing to be very careful about avoiding injuries, which are much more common at this stage of the hormonal fluctuations. My work day is exactly the same as it is every Tuesday. I work the same hours and I have the same meetings, because my part of the world has created a concept of time and decided that the best way to organize life was a clock and a recurring all-hands and year-round strawberries at the supermarket. There’s one more cycle I need to talk about today: the monthly IndieWeb Carnival cycle. Because here we are: it’s my turn to host! Let’s talk about cycles and fluctuations and give our world just a little more grace. About the IndieWeb carnival Every month, one person signs up to host the IndieWeb carnival. They choose a theme and encourage other people to write or create something about it. This month, it’s me! Here are my rules for this month: You can write in English or in any language you want. I’m always glad to see the web escape the domination of the English language! If you’re not a writer, you can choose any medium you wish to talk about community and belonging. The only thing I ask is that whatever medium you choose, it’s available on an independent platform – your own website, or a friend’s website, not a walled garden like Instagram or Medium. You can make several entries. Don’t forget to ping this article in yours and/or email me at the address in my sidebar so that I can read what you made! The deadline to post is November 30th, but it’s a soft deadline: if you message me one or two days late I won’t hold it against you. I’ll update this post with your creations all month, and may or may not do a roundup post (if it happens, it will probably come closer to mid-December). If I hate an entry (in terms of message, not of quality), I won’t share it: freedom of speech is great, and I’m also exercising my freedom of speech by only showcasing what I feel doesn’t make our world worse. Entries: Cycles and Fluctuations, by Jatan My writing inspiration lives through cycles, by Juha-Matti Santala Cycles and Fluctuations, by Henrique Dias Cycles and Patterns, by Andrei Fascist cycles, by V.H. Belvadi Throwing off my groove, by Bobby Hiltz ’tis the (small) season, by Z1NZ0L1N Where the tide speaks, by Crystal Touchton Cycle of life and death, by Jo You may also like: Embracing autumn https://alexsirac.com/wp-content/uploads/2023/01/cropped-cropped-cropped-portraitplante-100x100.webp",
      "author": "Alex",
      "authorUrl": "https://alexsirac.com/author/alex/",
      "date": "2025-10-26T14:08:40+01:00",
      "url": "https://alexsirac.com/indieweb-carnival-%e2%88%92-cycles-and-fluctuations/",
      "type": "unknown"
    }
  ]
}